In [11]:
import pandas as pd
import numpy as np

In [12]:
s1 = pd.Series([5, 6, 8, 3, np.nan,7])
s1

0    5.0
1    6.0
2    8.0
3    3.0
4    NaN
5    7.0
dtype: float64

In [16]:
s2 = pd.date_range('20201023', periods=6)
s2

DatetimeIndex(['2020-10-23', '2020-10-24', '2020-10-25', '2020-10-26',
               '2020-10-27', '2020-10-28'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df = pd.DataFrame(np.random.randn(6, 4), index=s2, columns = ['A','B', 'C', 'D'])
df

                   A         B         C         D
2020-10-23 -1.641951 -1.485266 -1.318645  0.202375
2020-10-24  1.675299 -1.099477  1.394698 -1.697100
2020-10-25 -0.369562  0.810555 -0.160058  0.187202
2020-10-26  0.079832 -1.427354 -0.282331  0.252168
2020-10-27  0.712228  0.201045  0.282064  1.664771
2020-10-28 -0.891087 -0.404018  0.045922 -1.888425

In [26]:
fruits = {
    'apples':[5, 3, 6, np.nan, 2],
    'Oranges': [5, 2, 3, 4, 7]
}

In [31]:
purchases = pd.DataFrame(data, index = ['Ahmed', 'Moh','Ali','Omr','Khalid']) 
purchases

        apples  Oranges
Ahmed      5.0        5
Moh        3.0        2
Ali        6.0        3
Omr        NaN        4
Khalid     2.0        7

In [32]:
purchases.to_csv('purchases.csv')

In [33]:
purchases.apples

Ahmed     5.0
Moh       3.0
Ali       6.0
Omr       NaN
Khalid    2.0
Name: apples, dtype: float64

In [36]:
purchases.loc['Moh']

apples     3.0
Oranges    2.0
Name: Moh, dtype: float64

In [39]:
purchases.loc[['Moh','Ali']]

     apples  Oranges
Moh     3.0        2
Ali     6.0        3

In [48]:
purchases[['apples','Oranges']]

        apples  Oranges
Ahmed      5.0        5
Moh        3.0        2
Ali        6.0        3
Omr        NaN        4
Khalid     2.0        7

In [53]:
purchases[purchases['apples'] >  4 ]

       apples  Oranges
Ahmed     5.0        5
Ali       6.0        3

In [59]:
purchases[:3]

       apples  Oranges
Ahmed     5.0        5
Moh       3.0        2
Ali       6.0        3

In [60]:
purchases[3:]

        apples  Oranges
Omr        NaN        4
Khalid     2.0        7

In [66]:
purchases.isnull()

        apples  Oranges
Ahmed    False    False
Moh      False    False
Ali      False    False
Omr       True    False
Khalid   False    False

In [67]:
purchases.isnull().sum()

apples     1
Oranges    0
dtype: int64